[Killed] BlockStatement
tdd-starter/src/katas/fizzbuzz.ts:1:42
-export const fizzbuzz = (num: number) => {
-    if (num % 15 === 0) {
-        return 'fizzbuzz';
-    }
-    if (num === 3) {
-        return 'fizz';
-    }
-    if (num % 5 === 0) {
-        return 'buzz';
-    }
-     return num;
-}
+export const fizzbuzz = (num: number) => {}
killedBy: fizzbuzz works as expected 1 returns 1
statusReason: expected undefined to equal 1

[Killed] ConditionalExpression
tdd-starter/src/katas/fizzbuzz.ts:2:9
 export const fizzbuzz = (num: number) => {
-    if (num % 15 === 0) {
+    if (false) {
         return 'fizzbuzz';
     }
killedBy: fizzbuzz works as expected 15 returns fizz
statusReason: expected 'buzz' to equal 'fizzbuzz'

[Killed] ArithmeticOperator
tdd-starter/src/katas/fizzbuzz.ts:2:9
 export const fizzbuzz = (num: number) => {
-    if (num % 15 === 0) {
+    if (num * 15 === 0) {
         return 'fizzbuzz';
     }
killedBy: fizzbuzz works as expected 15 returns fizz
statusReason: expected 'buzz' to equal 'fizzbuzz'

[Killed] BlockStatement
tdd-starter/src/katas/fizzbuzz.ts:5:20
     if (num % 15 === 0) {
         return 'fizzbuzz';
     }
-    if (num === 3) {
-        return 'fizz';
-    }
+    if (num === 3) {}
     if (num % 5 === 0) {
         return 'buzz';
killedBy: fizzbuzz works as expected 3 returns fizz
statusReason: expected 3 to equal 'fizz'

[Killed] EqualityOperator
tdd-starter/src/katas/fizzbuzz.ts:5:9
     if (num % 15 === 0) {
         return 'fizzbuzz';
     }
-    if (num === 3) {
+    if (num !== 3) {
         return 'fizz';
     }
killedBy: fizzbuzz works as expected 1 returns 1
statusReason: expected 'fizz' to equal 1

[Killed] StringLiteral
tdd-starter/src/katas/fizzbuzz.ts:6:16
         return 'fizzbuzz';
     }
     if (num === 3) {
-        return 'fizz';
+        return "";
     }
     if (num % 5 === 0) {
killedBy: fizzbuzz works as expected 3 returns fizz
statusReason: expected '' to equal 'fizz'

[Killed] BlockStatement
tdd-starter/src/katas/fizzbuzz.ts:8:24
     if (num === 3) {
         return 'fizz';
     }
-    if (num % 5 === 0) {
-        return 'buzz';
-    }
+    if (num % 5 === 0) {}
      return num;
 }
killedBy: fizzbuzz works as expected 5 returns buzz
statusReason: expected 5 to equal 'buzz'

[Killed] ConditionalExpression
tdd-starter/src/katas/fizzbuzz.ts:8:9
     if (num === 3) {
         return 'fizz';
     }
-    if (num % 5 === 0) {
+    if (true) {
         return 'buzz';
     }
killedBy: fizzbuzz works as expected 1 returns 1
statusReason: expected 'buzz' to equal 1
